cf/Catalogs/Ячейки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Ячейки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Склады</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проход</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ярус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поддон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Comment>наименование для сортировки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЗонаПриемки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьАвтоматическоеРаспределение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/Ячейки/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Наименование = Проход + "." + Секция + "." + Ярус + "." + Поддон;
	
	// Проверим что нет такого же с такими же данными
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ ИСТИНА ИЗ Справочник.Ячейки 
		|ГДЕ &Ссылка <> Ссылка И Владелец = &Владелец
		|И Секция = """ + Секция + """ 
		|И Проход = """ + Проход + """ 
		
		|И Ярус = """ + Ярус + """ 
		|И Поддон = """ + Поддон + """
		|");
	
	Запрос.УстановитьПараметр("Владелец", 	Владелец);
	Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отказ = Истина;
		ОбщиеФункции.СообщитьТекст("Ячейка с такимиже данными уже существует");	КонецЕсли;
	
	// Установим сортировку
	
	Если Не Отказ И ПустаяСтрока(Сортировка) Тогда
		Сортировка = Прав("000" + Проход, 3) + Прав("000" + Секция, 3)+ Прав("000" + Ярус, 3) + Прав("000" + Поддон, 3); КонецЕсли;
	
КонецПроцедуры
